package com.dmdev.hw6;


/**
 Создать класс, описывающий банкомат.

 Банкомат задается тремя свойствами:
 - количеством купюр номиналом 20, 50 и 100.

 Сделать методы для добавления денег в банкомат.

 Сделать метод, снимающий деньги: он принимает сумму денег, а возвращает булево значение - успешность выполнения операции.

 При снятии денег метод должен распечатывать каким количеством купюр какого номинала выдаётся сумма.

 Создать конструктор с тремя параметрами - количеством купюр каждого номинала.
 */
public class ATMRunner {
    public static void main(String[] args) {
    ATM atm = new ATM(2,3,4);
//    atm.putMoney(1,1,1);
    atm.withdrawMoney(450);
    }
}
